[AHWAdvBishop X2CharacterTemplate]
strCharacterName="Fanatic Bishop"

[AHWAdvInquisitor X2CharacterTemplate]
strCharacterName="Fanatic Inquisitor"

[AHWAdvCrusader X2CharacterTemplate]
strCharacterName="Fanatic Crusader"

[AHWAbility_EngagePsiSelfDestruct X2AbilityTemplate]
LocFriendlyName="For The Glory Of The Elders"
LocLongDescription="Charge the Crusader's body with a Psionic Empowerment, enabling them to explode upon death."
LocHelpText="Charge the Crusader's body with a Psionic Empowerment, enabling them to explode upon death."
LocFlyOverText="For The Glory Of The Elders"

[AHWAbility_BendingReed X2AbilityTemplate]
LocFriendlyName="Bending Reed"
LocLongDescription="Inquisitors gain bonus movement points after melee attacking."
LocHelpText="Inquisitors gain bonus movement points after melee attacking."
LocFlyOverText="Bending Reed"

[AHWAbility_TriggerPsiSelfDestruct X2AbilityTemplate]
LocFriendlyName="For The Glory Of The Elders"
LocLongDescription="Detonate the Crusader's Psionic Empowerment, killing them but dealing massive Area of Effect damage."
LocHelpText="Detonate the Crusader's Psionic Empowerment, killing them but dealing massive Area of Effect damage."
LocFlyOverText="For The Glory Of The Elders"

[AHWAbility_LightningBolt X2AbilityTemplate]
LocFriendlyName="Blast Bolt"
LocLongDescription="Fire a highly damaging bolt of Psionic Energy that dazes its target."
LocHelpText="Fire a highly damaging bolt of Psionic Energy that dazes its target."
LocFlyOverText="Blast Bolt"

[AHWAbility_ShockLance X2AbilityTemplate]
LocFriendlyName="Shock Lance"
LocLongDescription="Melee attack an enemy with an extremely high chance to Daze them."
LocHelpText="Melee attack an enemy with an extremely high chance to Daze them."
LocFlyOverText="Shock Lance"

[AHWAbility_TheCulling X2AbilityTemplate]
LocFriendlyName="The Culling"
LocLongDescription="Directly execute a Dazed target with a special melee attack. The target will not bleed out. The target will not sustain."
LocHelpText="Directly execute a Dazed target with a special melee attack. The target will not bleed out. The target will not sustain."
LocFlyOverText="The Culling"

[FanaticPlasmaRifle_AHW X2WeaponTemplate]
FriendlyName="Fanatic Plasma Rifle"
FriendlyNamePlural="Fanatic Plasma Rifles"
BriefSummary="Special Plasma Weaponry given only to the most ardent of the Warlock's Faithful flock."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"

[FanaticShockLance_AHW X2WeaponTemplate]
FriendlyName="Fanatic Shock Lance"
FriendlyNamePlural="Fanatic Shock Lances"
BriefSummary="Special Stun Lances given to only the Warlock's Inquisitors."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"

[FanaticShockGrenade_AHW X2GrenadeTemplate]
FriendlyName="Fanatic Shock Grenade"
FriendlyNamePlural="Fanatic Shock Grenades"
BriefSummary="Fanatic Shock Grenade deals electrical damage and stuns all affected units that can be stunned."
TacticalText="<Bullet/> EMP Bombs, upgraded from EMP Grenades, deal even greater damage in a greater radius to mechanical enemies.<br><Bullet/> EMP Bombs ignore armor when dealing damage.<br><Bullet/> EMP Bombs can be thrown or launched considerably further than standard grenades."
ThrownAbilityName="Throw Fanatic Shock Grenade"
ThrownAbilityHelpText="Damage and stun units in the target area."
LaunchedAbilityname="Fanatic Shock Grenade"
LaunchedAbilityHelpText="Damage and stun units in the target area."